Revit 2026 API

# DisplayingOptionsDialogEventArgsAddTab Method

---

Add tab to option dialog with tab name and handler information.

**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddTab(
	string newTabName,
	TabbedDialogExtension tabbedDialogExtension
)
```
```vb
Public Sub AddTab (
	newTabName As String,
	tabbedDialogExtension As TabbedDialogExtension
)
```
```cpp
public:
void AddTab(
	String^ newTabName,
	TabbedDialogExtension^ tabbedDialogExtension
)
```
```fsharp
member AddTab :
        newTabName : string *
        tabbedDialogExtension : TabbedDialogExtension -> unit
```

#### Parameters

newTabName String
     The new tab page name.
tabbedDialogExtension TabbedDialogExtension
     The handlers information for the new tab page.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the limit of pages allowed in the Options dialog will be exceeded (99). |

There is a limit to the number of options page permitted in the dialog.

#### Reference

DisplayingOptionsDialogEventArgs Class

Autodesk.Revit.UI.Events Namespace